app/controllers/posts_controller.rb

  def create
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save
---
SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2021-03-15 22:59:25.414228"], ["updated_at", "2021-03-15 22:59:25.414228"], ["author_id", 1]]